Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisPartPositionProperties Property
 The analysis part position properties.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartPositionProperties AnalysisPartPositionProperties { get; set; }
Public Property AnalysisPartPositionProperties As AnalysisPartPositionProperties
	Get
	Set
Property Value
Type: AnalysisPartPositionProperties
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace